taile dataset: 1000
taile batch: 100
nombre epochs: 100
Nombre d'échecs: 29847
Nombre de succes: 860
Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 19)]              0         
                                                                 
 dense (Dense)               (None, 38)                760       
                                                                 
 dense_1 (Dense)             (None, 76)                2964      
                                                                 
 dense_2 (Dense)             (None, 38)                2926      
                                                                 
 dense_3 (Dense)             (None, 19)                741       
                                                                 
=================================================================
Total params: 7,391
Trainable params: 7,391
Non-trainable params: 0
_________________________________________________________________
