taile dataset: 100
taile batch: 100
nombre epochs: 50
Nombre d'échecs: 1
Nombre de succes: 4999

Fonctions d'activations: relu
Fonctions d'activations output: sigmoid
Optimizer: <keras.optimizer_v2.adam.Adam object at 0x7fafc84f7f40>

Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 19)]              0         
                                                                 
 dense (Dense)               (None, 38)                760       
                                                                 
 dense_1 (Dense)             (None, 76)                2964      
                                                                 
 dense_2 (Dense)             (None, 38)                2926      
                                                                 
 dense_3 (Dense)             (None, 19)                741       
                                                                 
=================================================================
Total params: 7,391
Trainable params: 7,391
Non-trainable params: 0
_________________________________________________________________
